[
  {
    "version": "8.0.90mc",
    "hardware": [
      "ICX7650-48P",
      "ICX7750-48F",
      "ICX7450-32ZP",
      "ICX7850-48F",
      "ICX7750",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX7250-48P",
      "ICX7150-48PF",
      "ICX7250-24G",
      "ICX7150",
      "ICX7150-24P",
      "ICX7650-48F",
      "ICX7250",
      "ICX7750-48C",
      "ICX7450",
      "ICX7450-48P",
      "ICX7150-48ZP",
      "ICX7750-26Q",
      "ICX7850-32Q",
      "ICX7850-48FS",
      "ICX7650",
      "ICX7450-24P",
      "ICX7250-24P",
      "ICX7450-48F"
    ],
    "software_features": [
      "The ability to enable CLASS 73 auto-negotiation on individual ports. New Software Features in 08.0.90f There are no new features in release 08.0.90f. New Software Features in 08.0.90e There are no new features in release 08.0.90e. New Software Features in 08.0.90d There are no new features in release 08.0.90d. New Software Features in 08.0.90c The following software features and enhancements are introduced in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description FQDN for ICX-Management connection to SmartZone An ICX device can receive a fully qualified domain name (FQDN) in response to a switch registrar query and use it to connect to ICX-Management on a SmartZone device. Previously, only IP addresses could be returned in response to a switch registrar query. New Software Features in 08.0.90b The following software features and enhancements are introduced in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description Accessing RADIUS MIB objects through SNMP is enabled by default. As a result, Refer to the FastIron Security Configuration Guide for information on RADIUS or a related command, enable snmp config-radius, has been deprecated. SNMP capabilities. Refer to the FastIron MIB Reference for information on MIB objects. Accessing TACACS MIB objects through SNMP is enabled by default. As a result, Refer to the FastIron Security Configuration Guide for information on TACACS or a related command, enable snmp config-tacacs, has been deprecated. SNMP capabilities. Refer to the FastIron MIB Reference for information on MIB objects. FastIron 08.0.90mc for RUCKUS ICX Switches Release Notes, Version 1 Part Number: 53-1005731-01 13 New in This Release Software Features New Software Features in 08.0.90a The following software features and enhancements are introduced in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description MACsec support on the ICX 7850 Refer to the FastIron Software Licensing Guide for information about getting a MACsec license for an ICX 7850. LRM adapter module support on the ICX 7850 Ruckus ICX7150, ICX7250, ICX7750, and ICX 7850 Ethernet switches require a long-Reach Multimode (LRM) adaptor module to support LRM optics connections. New Software Features in 08.0.90 The following software features and enhancements are introduced in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description Software upgrade using a Unified FastIron Image (UFI) on the ICX 7850 A Unified FastIron Image (UFI), consisting of the application image, the boot code image, and the signature file, can be downloaded in a single file. Beginning with FastIron 08.0.90, any new ICX hardware platform (starting with the ICX 7850) will use only UFIs. FastIron 08.0.90 support for the new ICX 7850 Switch Nearly all FastIron features are supported on the ICX 7850, with the exception of Bidirectional Forwarding Detection, Campus Fabric, and OpenFlow. To see a detailed list of the specific features that are supported, refer to the FastIron Features and Standards Support Matrix, Release 08.0.90. Multiple VLAN Registration Protocol (MVRP) MVRP is an IEEE 802.1ak Multiple Registration Protocol (MRP) application that allows dynamic VLAN configuration and distribution of VLAN membership information in a bridged local area network. An MVRP-aware switch can exchange VLAN configuration information with other MVRP-aware switches, prune unnecessary broadcast and unknown unicast traffic, and dynamically create and manage VLANs on switches. With MVRP, an access switch can be manually configured with all the desired VLANs for the network, and all other switches on the network can learn those VLANs dynamically. When the VLAN configurations on a switch are changed, MVRP automatically changes the VLAN configurations in the required switches. LLDP on by default The system enables the LLDP feature globally by default during boot up, for standalone switches and stacking mode. Applies only to new ICX switches from the factory or those that have been set back to the default configuration. Not supported in Campus Fabric implementations. Default username and password The device allows initial access only after using the default local username (super) and password (sp-admin). The administrator will be prompted to change the default password after logging in for the 1st time. ICX devices that are already deployed with a previous release and upgraded to 08.0.90 will not be affected by this change. SSH enabled by default This feature provides SSH access to the device out of the box, without the need for manual intervention to generate SSH keys. LAG between different default port speeds Config speed validation is performed as part of port addition to LAG, and ports with same config speed as that of the virtual LAG interface are accepted. This new feature adds validation of the duplex of the ports against the vlag interfaces in addition to the configuration speed validation. MSTP path-cost configuration This feature is enhanced to support MSTP in a range of ports. FastIron 08.0.90mc for RUCKUS ICX Switches Release Notes, Version 1 14 Part Number: 53-1005731-01 New in This Release Software Features Feature Description TCP MSS TCP MSS Adjustment feature is to avoid the overhead of fragmentation of the TCP data packet and to prevent TCP sessions getting time out due to non- support of fragmentation in the path. Bidirectional Forwarding Detection (BFD) BFD is a lightweight hello protocol, with little system overhead, used to rapidly detect link faults without overloading the system. BFD improves network performance by providing fast forwarding path failure detection times, switching traffic to an alternate path when necessary, in order to minimize traffic loss. BFD works by checking that the next-hop device is alive, thus providing rapid detection of the failure of a forwarding path. BFD can detect the failure of the forwarding plane in a sub-second time interval that is user-configurable. Supported on the ICX 7750 only. Dynamic Host Configuration Protocol version 6 (DHCPv6) Server DHCPv6 is a network protocol for configuring IPv6 hosts with IP addresses, IP prefixes, and other configuration data required to operate in an IPv6 network. All FastIron devices can be configured to function as DHCPv6 servers. DHCPv6 Server functions in the same manner as DHCP for IPv4, allocating temporary or permanent network IPv6 addresses to clients. DHCPv6 Server also allows for greater control of address distribution within a subnet. Forwarding Profiles Forwarding Profiles allows for the configuration of the Unified Forwarding Table (UFT) so that it suits deployment requirements. A predefined forwarding profile can be selected based on scaling requirements. This UFT partition is carried out during the initialization process and is effective after a system reload. Supported on the ICX 7850 only. IPv6 Neighbor Discovery (ND) Proxy IPv6 Neighbor Discovery(ND) Proxy enables the hosts in different broadcast domains or VLANs to communicate with each other. An IPv6 Proxy-enabled interface responds to a neighbor discovery request on behalf of host connected to another interface. Syslog messages for xSTP Syslog messages for xSTP inform if the CPU utilization is higher than the normal value and the BPDU processing rate is higher than the threshold limit. Syslog messages are generated depending upon the received STP or PVST BPDUs. Packet Statistics Enhancement This enhancement enables the system to count packets destined to the CPU based on programmable fields. The user can define the maximum unique field matches to be counted. ICX 7850 stacking Traditional stacks of up to 12 ICX 7850 units are supported Interactive-setup for stacking replaces stack secure-setup The stack interactive-setup command is introduced to streamline and assist in stack configuration. The stack secure-setup command is deprecated. Zero-touch provisioning for stacking The stack zero-touch-enable command is introduced to allow automatic stack configuration. Elimination of required default-ports configuration The default-ports command is deprecated beginning with this release. Configuring stacking ports is simplified. Two-unit linear-topology stacking trunks From this release, two-unit linear-topology trunks are supported on all ICX stackable models. The linear-topology trunk doubles the bandwidth of the stacking ports between two units and provides the same redundancy as a two- unit ring through trunk load balancing. New configuration rules for stacking ports and trunks Using the stack-port and stack-trunk commands is more intuitive, and some previous restrictions have been eliminated. FastIron 08.0.90mc for RUCKUS ICX Switches Release Notes, Version 1 Part Number: 53-1005731-01 15 New in This Release",
      "Support for fragmentation of control packets in IPSec tunnels"
    ],
    "cli_commands": {
      "new": [],
      "modified": [
        "The gig-default command was modified in 08.0.90g. No"
      ],
      "deprecated": [],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": []
  },
  {
    "version": "8.0.91",
    "hardware": [
      "ICX7650-48P",
      "ICX7750-48F",
      "ICX7450-32ZP",
      "ICX7850-48F",
      "ICX7750",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX7250-48P",
      "ICX7150-48PF",
      "ICX7250-24G",
      "ICX7150",
      "ICX7150-24P",
      "ICX7650-48F",
      "ICX7250",
      "ICX7750-48C",
      "ICX7450",
      "ICX7450-48P",
      "ICX7150-48ZP",
      "ICX7750-26Q",
      "ICX7850-32Q",
      "ICX7150-24F",
      "ICX7850-48FS",
      "ICX7650",
      "ICX7450-24P",
      "ICX7250-24P",
      "ICX7450-48F"
    ],
    "software_features": [
      "Automation with Ansible Ansible can be used to set up automation and configuration: management of ICX switches. Ansible support for the Ruckus ICX series of product can be found at https://docs.ansible.com/ansible/ latest/modules/list_of_network_modules.html#icx",
      "EEE support on the ICX 7150 Support for Energy Efficient Ethernet is added to the ICX 7150."
    ],
    "cli_commands": {
      "new": [
        "No"
      ],
      "modified": [
        "ip ssh idle-time"
      ],
      "deprecated": [],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": [
      "ICX7150"
    ]
  },
  {
    "version": "8.0.92e",
    "hardware": [
      "ICX7650-48P",
      "ICX7750-48F",
      "ICX7450-32ZP",
      "ICX7850-48F",
      "ICX7750",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX7250-48P",
      "ICX7150-48PF",
      "ICX7250-24G",
      "ICX7150",
      "ICX7150-24P",
      "ICX7650-48F",
      "ICX7250",
      "ICX7750-48C",
      "ICX7450",
      "ICX7450-48P",
      "ICX7150-48ZP",
      "ICX7750-26Q",
      "ICX7850-32Q",
      "ICX7150-24F",
      "ICX7850-48FS",
      "ICX7650",
      "ICX7450-24P",
      "ICX7250-24P",
      "ICX7450-48F"
    ],
    "software_features": [],
    "cli_commands": {
      "new": [
        "for RUCKUS ICX Switches Release Notes Version 1",
        "New in This Release",
        "CLI Commands",
        "enable password-display",
        "ipv6 address",
        "show ip bgp neighbors",
        "show ip ospf",
        "show snmp"
      ],
      "modified": [],
      "deprecated": [
        "spanning-tree rstp"
      ],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": [
      "C08PT"
    ]
  },
  {
    "version": "8.0.95pb1",
    "hardware": [
      "ICX7650-48P",
      "ICX7750-48F",
      "ICX7550-48ZP",
      "ICX7850-48F",
      "ICX7450-32ZP",
      "ICX7550-24F",
      "ICX7750",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX7250-48P",
      "ICX7150-48PF",
      "ICX7250-24G",
      "ICX7550-48F",
      "ICX7150",
      "ICX7150-24P",
      "ICX7650-48F",
      "ICX7250",
      "ICX7750-48C",
      "ICX7450",
      "ICX7450-48P",
      "ICX7150-48ZP",
      "ICX7750-26Q",
      "ICX7850-32Q",
      "ICX7550-24P",
      "ICX7550-48P",
      "ICX7150-24F",
      "ICX7850-48FS",
      "ICX7550",
      "ICX7650",
      "ICX7450-24P",
      "ICX7250-24P",
      "ICX7550-24ZP",
      "ICX7450-48F"
    ],
    "software_features": [
      "No reboot required Users are no longer required to reboot the switch when trying to enable DHCP/DHCP6 snooping, Dynamic ARP inspection etc. ACL-per-port-per-vlan configuration is implicitly enabled and is no longer required to be configured separately.",
      "Group level CLI config: Users can predefine configuration for switch groups with the option to define different configurations based on the switch model. Switches will automatically inherit the configuration upon joining the group.",
      "Ability to configure security features at a VLAN level The following features can now be configured directly on a VLAN without having to create a VE interface. – IPv4 and IPv6 ACLs – Denial of Service protection",
      "CLI templates: CLI templates enable users to make incremental configuration changes to the selected switches. Geo redundancy Geo-Redundancy (Active-Passive mode) is now supported for switches with SmartZone 6.0. DHCP client MIB Adds SNMP support for DHCP client on a VE. CLI configuration changes on RUCKUS Cloud Release 08.0.95b along with RUCKUS Cloud Version 20.11 introduces capability to make configuration changes via CLI even when the switch is connected to the Cloud. New Software Features in 08.0.95a No new features were added in this release. New Software Features in 08.0.95 The following software features and enhancements are added in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https://support.ruckuswireless.com/, for a detailed listing of feature and platform support. FastIron 08.0.95pb1 for RUCKUS ICX Switches Release Notes Version 1 16 Part Number: 53-1005838-01 New in This Release Software Features Feature Description Security feature enhancements FastIron 08.0.95 release brings several security feature enhancements making it easier to apply and monitor them across Layaer-2 and Layer-3 images.",
      "MAC Access Control Lists MAC ACLs are introduced to make MAC-based traffic filter usage similar to IPv4 ACLs. MAC ACLs replace the previously supported MAC filters feature. CLI configuration will automatically be converted from MAC filters to MAC ACLs when upgrading from e releases.",
      "Source Guard ACL Source Guard ACLs are introduced to work in conjunction with IP Source Guard (IPSG).",
      "Enhanced Show commands The output is enhanced for a wide range of Access-list and security feature commands, providing easy access to feature settings. MVRP with Per-VLAN STP and Per-VLAN RSTP MVRP is enhanced to support Per-VLAN Spanning Tree (PVST). On both Layer 2 switch images and router images, PVST is enabled by default on MVRP untagged VLANs. You can use the mvrp spanning-tree command to choose the type of spanning tree to be added to the dynamic VLANs. ICX 7850 as control bridge ICX 7850 devices can be enabled as a control-bridge standalone or stack in an 802.1br (SPX) Campus Fabric configuration. Nexthop scale enhancements A higher IP nexthop table size is supported for all platforms. For ICX 7850 devices, a new entry has been added to the predefined forwarding profiles. The IP nexthop table size has been added to the predefined forwarding profile for these devices. Unicast and Multicast scale enhancements on the ICX 7850 New forwarding profiles with enhanced unicast and multicast scale numbers are supported in this release. FDB scale enhancements for the ICX 7850 For the ICX 7850, the maximum number of FDB table entries has been increased, and four predefined forwarding profiles are now supported. Slowpath forwarding of IPv4 and IPv6 multicast packets The slow path forwarding of IPv4 and IPv6 multicast data packets is enabled by default for PIM-SM groups and disabled by default for PIM-SSM groups. Default settings for slow path forwarding of IPV4 and IPV6 multicast data packets can be changed by configuration. Show IP traffic for TCP and UDP statistics The command output for the show ip traffic and show ipv6 traffic commands was modified to show more detailed information for Transmission Control Protocol (TCP) and User Datagram Protocol (UDP) statistics. DHCP client on non-default Virtual Ethernet port The DHCP client can now be enabled for a non-default Virtual Ethernet (VE) port. By default, the DHCP client is enabled for the default VE port. IEEE 1588v2 PTP Transparent Clock PTP ensures clock synchronization in a packet-based network corrects the latency and time delays. A Transparent Clock (TC) measures the time taken for a PTP event message to transit the device, and provides this information to clocks receiving this PTP event message. FastIron 08.0.95pb1 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005838-01 17 New in This Release Important Notes Feature Description Inter-VRF route leaking using static routes VRF route leaking between different VRFs allows you to share selective route information between different VRFs. Inter-VRF route leaking allows leaking of route prefixes from one VRF instance to another VRF instance on the same physical router, which eliminates the need for external routing. L3 syslog for IPv6 route table exhaust Added Syslogs that indicate the routing table is full. VxLAN support VXLAN support is extended to ICX 7650 and ICX 7850. Important Notes If a fiber optic transceiver is unplugged and plugged in again rapidly, the link may not come up. Allow a delay of 2 to 5 seconds between unplugging and reinserting the optic to ensure optic detection and that the link comes up without issues. ICX 7150, ICX 7250, ICX 7450 PoE not working The ICX 7150, ICX 7250, and ICX 7450 devices with PoE FW version 2.1.8 can have PoE not working on any of the ports. Use FastIron release 08.0.95pb1 to correct this issue. The FastIron release 08.0.95pb1 used PoE firmware 1.8.8 instead of 2.1.8. Important Changes in Release 08.0.95h Per Technical Support Bulletin TSB 2022-005 - Starting with release 8.0.95h/9.0.10d, products running a newer Power Over Ethernet (PoE) chipset do not support older releases, the POE functionality in ICX 7150 and ICX 7450 devices that have the new MCU PD69220 will not be allowed to join a stack running a pre-08.0.95h software image. The MCU PD69220 can be indenified by the #show inline power detail command. device# show inline power detail ⁞ Firmware Version ---------------- 02.2.4 Build 002 If you are installing an ICX 7150 or ICX 7450 device that contains MCU PD69220, you can prevent the POE capabilities of the device from being disabled by upgrading the stack to FastIron 08.0.95h or later firmware prior to installing the ICX 7150 or ICX 7450 device. Refer to the Technical Support Bulletins page for more details. Changed Behavior in Release 08.0.95 Please note that Campus Fabric is supported in 08.0.95 and will continue to be supported in 08.0.95 maintenance releases. Campus Fabric will not be supported in later FastIron releases, such as 09.0.10a. Refer to the Software Features on page 14 section for a list of new features in the 08.0.95 release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. FastIron 08.0.95pb1 for RUCKUS ICX Switches Release Notes Version 1 18 Part Number: 53-1005838-01 New in This Release"
    ],
    "cli_commands": {
      "new": [],
      "modified": [],
      "deprecated": [],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": [
      "RUCKUS"
    ]
  },
  {
    "version": "9.0.00a",
    "hardware": [
      "ICX7650-48P",
      "ICX7550-48ZP",
      "ICX7850-48F",
      "ICX7550-24F",
      "ICX7750",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX7250-48P",
      "ICX7150-48PF",
      "ICX7250-24G",
      "ICX7550-48F",
      "ICX7150",
      "ICX7150-24P",
      "ICX7650-48F",
      "ICX7550-24ZP",
      "ICX7250",
      "ICX7450",
      "ICX7450-48P",
      "ICX7150-48ZP",
      "ICX7850-48C",
      "ICX7850-32Q",
      "ICX7550-24P",
      "ICX7150-24F",
      "ICX7850-48FS",
      "ICX7550",
      "ICX7650",
      "ICX7450-24P",
      "ICX7250-24P",
      "ICX7550-48P",
      "ICX7450-48F"
    ],
    "software_features": [
      "Release 09.0.00 and future releases do not support ICX 7750 devices. The ICX 7750 is supported in 08.0.95 and will continue to be supported in 08.0.95 maintenance releases. FastIron 09.0.00a for Ruckus ICX Switches Release Notes Version 1 12 Part Number: 53-1005730-01 New in This Release",
      "Campus Fabric is not supported in FastIron 09.0.00 or later releases. Campus Fabric is supported in 08.0.95 and will continue to be supported in 08.0.95 maintenance releases."
    ],
    "cli_commands": {
      "new": [],
      "modified": [],
      "deprecated": [
        "cfg-archive management archive-size",
        "cfg-archive management compare-archives",
        "cfg-archive management compare-running-config",
        "cfg-archive management copy",
        "cfg-archive management copy-running-config",
        "cfg-archive management delete",
        "cfg-archive management list",
        "cfg-archive management reload-with-archive",
        "cfg-archive management rename",
        "cfg-archive management show-archive-content",
        "clear dlogger logs",
        "cli timeout",
        "dlogger redirect",
        "dlogger module",
        "flexlink backup",
        "flexlink preemption delay",
        "flexlink preemption mode",
        "interface cpu active",
        "ip multicast edge-port",
        "ip multicast flood-unregistered",
        "ip multicast static-mcache profile",
        "ipv6 multicast flood-unregistered",
        "logmgr fetch",
        "logmgr help",
        "logmgr hierarchy",
        "logmgr monitor",
        "New in This Release",
        "CLI Commands",
        "logmgr upload",
        "management access",
        "management source-interface",
        "management vrf",
        "restconf enable",
        "restconf config-sync",
        "restconf config-sync-interval",
        "restconf enable-config-sync",
        "restconf platform-debug-level",
        "restconf protocol-debug-level",
        "show dlogger logs",
        "show dlogger module",
        "show flexlink",
        "show ip multicast static-mcache-profile",
        "show ip multicast vlan",
        "show ip ssl device-certificate",
        "show log debug management restconf all",
        "show restconf config",
        "show restconf event-counters",
        "show restconf status",
        "show restconf running-config",
        "show management access",
        "snmp-server log-suppress-timer",
        "white-list (Web Authentication)"
      ],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": []
  },
  {
    "version": "9.0.10k",
    "hardware": [
      "ICX7650-48P",
      "ICX7550-48ZP",
      "ICX7850-48F",
      "ICX7550-24F",
      "ICX7750",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX7250-48P",
      "ICX7150-48PF",
      "ICX7250-24G",
      "ICX7550-48F",
      "ICX7150",
      "ICX7150-24P",
      "ICX7650-48F",
      "ICX7250",
      "ICX7450",
      "ICX7450-48P",
      "ICX7150-48ZP",
      "ICX7850-48C",
      "ICX7850-32Q",
      "ICX7550-24P",
      "ICX7550-48P",
      "ICX7150-24F",
      "ICX7850-48FS",
      "ICX7550",
      "ICX7650",
      "ICX7450-24P",
      "ICX7250-24P",
      "ICX7550-24ZP",
      "ICX7450-48F"
    ],
    "software_features": [
      "The option followed by a valid hex value will add the value keyword hex and will interpret the following entry as a hex value.",
      "New web UI FI 09.0.00 introduces a brand-new web user interface with monitoring,: configuration, remote CLI, and firmware upgrade capabilities.",
      "Support Save Support Save collects logs and information to help troubleshoot an issue.",
      "Deprecated Software Features in 09.0.10a",
      "Web management - AAA Settings Configures the settings to enable web user authentication.",
      "platform that provides solutions for point-to-point connectivity and Ethernet-: based audio visual (AV) distribution. A number of enhancements have been introduced for SDVoE.",
      "MCT-Stacking ICX 7850 stacks can be configured as cluster peers in a Multi-Chassis Trunking: (MCT) configuration.",
      "website or server during the authentication process. The white-list can be: defined using IPv4 addresses or FQDN entries.",
      "ASCII string Enter algorithms separated by a space:: ecdsa-sha2-nistp256 ecdsa-sha2-nistp384 rsa-sha2-512 rsa-sha2-256 ssh-rsa device(config)# ip ssh host-key-method ssh-rsa",
      "Campus Fabric is not supported in FastIron 09.0.10a or later releases. Campus Fabric is supported in 08.0.95 and will continue to be supported in 08.0.95 maintenance releases.",
      "Refer to the Technical Support Bulletins page for more details.",
      "Additionally, the maximum number of MLD group addresses for the default VRF,: or a non-default VRF instance, can be changed globally or at the interface level.",
      "MVR is supported for router images only.",
      "Remote Network Monitoring (RMON) is not supported in 09.0.10a. It is re-introduced in 09.0.10c.",
      "MACsec over VXLAN MACsec over VXLAN is an end-to-end security protocol that provides a secured: environment to protect Ethernet frames traveling over IP networks. Although",
      "page.",
      "– line (enable via Telnet password)",
      "threshold percentage is exceeded, the system generates a warning message.",
      "for all the multicast group addresses and for all source addresses.",
      "release 09.0.10a to 09.0.10h.",
      "www.ruckuswireless.com, for a detailed listing of feature and platform support.",
      "condtions are not met.",
      "details.",
      "Feature Description",
      "accepted only an ASCII string value.",
      "configuration files in flash. These backed up files can be copied to running: configuration to manage system configuration when needed.",
      "VRF, or a non-default VRF instance, can be changed globally or at interface level.",
      "multicast sources or groups are blocked.",
      "hexadecimal values or IP addresses when specified. To accommodate this: change, the syntax is modified as follows: option vendor-encapsulated-options { ascii string | hex value | ip ip-address }",
      "Layer-2 extension across LAN/WAN using cross-connect VNIs.",
      "experience SSH connection issues.",
      "device# configure terminal: device(config)# ip ssh key-ex key-exchange-method SSH key exchange method device(config)# ip ssh key-exchange-method",
      "09.0.10a and later releases unless specifically noted.",
      "Configuration Guide.",
      "For example:: device# configure terminal device(config)# ip dhcp-server pool 1 device(config-dhcp-1)# option vendor-encapsulated- options ip address 10.10.10 device# configure terminal device(config)# ip dhcp-server pool 1 device(config-dhcp-1)# option vendor-encapsulated- options hex 061731302e31302e31302e31302c31322e31322e31322e3132 device# configure terminal device(config)# ip dhcp-server pool 1 device(config-dhcp-1)# option vendor-encapsulated- options ascii test",
      "Additionally, the maximum number of IGMP group addresses for the default",
      "Flexlink Flexlink is a link redundancy feature that provides Layer 2 resilience. It is an: alternative solution to Spanning Tree Protocol (STP) as it provides link redundancy at a faster network convergence rate than STP and its variants RSTP/",
      "VXLAN provides Layer 2 extension across LAN/WAN, connections between sites: are not secured. MACsec over VXLAN addresses this and achieves secured",
      "Change Default VLAN",
      "device can be configured. The rate limit for the number of register messages can: be set to a relatively low value to avoid adverse pressure on the CPU when numerous sources start concurrently.",
      "HTTPS is enabled by default.",
      "To access LAG interface configuration, you must enter the LAG interface number. You can no longer access LAG interface configuration using the member ports.",
      "new solution allows two units running 09.0.10 and higher software releases to: form MCT peers, as long as their MCT protocol versions match and both peers are from the same model family.",
      "IPv6 Source Guard FI 09.0.0 introduces IPv6 Source Guard support which can be used with IPv6",
      "Enabling SSH Communication Between 09.0.10j Devices and 08.0.95 Devices",
      "Beginning with 09.0.00 release, the logs that are generated using the debug and distributed logger utilities are sent to the Log Manager. The Log Manager infrastructure provides the capability to store the application log files in a centralized repository. The centralized repository can be accessed to display the log files using the show logging debug command. Log manager is enhanced to upload the fetched logs to an external server. It also allows you to monitor real-time updates to the specified logs on local units.",
      "CPU-bound packets matching the ACL rules",
      "The following authentication methods are no longer supported: – line (enable via Telnet password) FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005859-01 25 New in This Release Known Behavior – enable (via configured password for Super-User level privileges) – TACACS",
      "custom port for connecting to SmartZone.",
      "Release 09.0.10a and later releases support only SHA-512 encryption. The following encyption types are deprecated: – service password-encryption sha1 – service password-encryption sha256 NOTE Any user accounts created with the deprecated methods are deleted when the switch is upgraded to FastIron 09.0.10a or later releases.",
      "unauthorized multicast sources or groups are blocked.",
      "Multicast data is supported for MVR. Refer to \"Multicast VLAN Registration\" in the RUCKUS FastIron IP Multicast Configuration Guide. PTP Support on ICX 7150-48ZP Precision Transparent Timing adds support for the ICX 7150-48ZP model. Refer to \"Precision Time Protocol\" in the RUCKUS FastIron Management Configuration Guide. Supportsave Enhancements Refer to \"Supportsave\" in the RUCKUS FastIron Web Management Interface User Guide. FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005859-01 19 New in This Release Software Features Feature Description DHCP Option 43 enhancement In FastIron 09.0.00 and 09.0.10, DHCP Option 43, vendor-encapsulated-options, accepted only an ASCII string value. In FastIron release 09.0.10a, the option command is modified to accept hexadecimal values or IP addresses when specified. To accommodate this change, the syntax is modified as follows: option vendor-encapsulated-options { ascii string | hex value | ip ip-address } For example: device# configure terminal device(config)# ip dhcp-server pool 1 device(config-dhcp-1)# option vendor-encapsulated- options ip address 10.10.10 device# configure terminal device(config)# ip dhcp-server pool 1 device(config-dhcp-1)# option vendor-encapsulated- options hex 061731302e31302e31302e31302c31322e31322e31322e3132 device# configure terminal device(config)# ip dhcp-server pool 1 device(config-dhcp-1)# option vendor-encapsulated- options ascii test Refer to the option command in the RUCKUS FastIron Command Reference. When the device is upgraded from FastIron 09.0.00 or FastIron 09.0.10 to FastIron 09.0.10a, the command modification is interpreted as follows:",
      "releases.",
      "Refer to \"Configuring a Custom Port Number for Connection to SmartZone\" in: the RUCKUS FastIron Management Configuration Guide.",
      "Beginning in 09.0.10a, ICX 7150 and ICX 7250 platforms are limited to a maximum of eight units in a stack.",
      "to use the keychain settings.",
      "Query messages are supported for MVR.",
      "supported in 08.0.95 maintenance releases.: • Release 09.0.10a and future releases do not support ICX 7750 devices. The ICX 7750 is supported in 08.0.95 and will continue to be supported in 08.0.95 maintenance releases. • Remote Network Monitoring (RMON) is not supported in 09.0.10a. It is re-introduced in 09.0.10c. • Beginning in 09.0.10a, ICX 7150 and ICX 7250 platforms are limited to a maximum of eight units in a stack. • Image copy using the system-manifest will accept only \"/\". The system will not accept \"\\\" as it did in 08.0.95 and earlier releases. • HTTPS is enabled by default. • All access to ICX devices is via username and password only. Login without a username or without a password is no longer suppported. • To access LAG interface configuration, you must enter the LAG interface number. You can no longer access LAG interface configuration using the member ports. • Beginning with 09.0.00 release, the logs that are generated using the debug and distributed logger utilities are sent to the Log Manager.",
      "configuration if the changed running configuration is not saved to the non-: volatile memory within a pre-defined time.",
      "are not met.",
      "Important Changes in Release 09.0.10d",
      "ACLs on CPU Ports Brings in the ability to control traffic destined for CPU. Examples include ICMP: packets, DHCP packets etc., User will be able to apply access-lists to allow/drop",
      "Important Changes in Release 09.0.10a",
      "service password-encryption sha256 NOTE Any user accounts created with the deprecated encryption types are deleted when the switch is upgraded to FastIron release 09.0.10a or later. Important Changes in Release 09.0.10j Enabling SSH Communication Between 09.0.10j Devices and 08.0.95 Devices Due to the differences in default key exchange and host key algorithms in different FastIron releases, devices running different releases may experience SSH connection issues. For devices running FastIron release 09.0.10a to 09.0.10h, when trying to establish an SSH connection with a device running FastIron release 08.0.95 or earlier, a mismatch in algorithms prevents the SSH connection from being established. The problem arises during the negotiation phase, where the server offers key exchange and host key algorithms that are not compatible with the default settings of the device running FastIron release 09.0.10a to 09.0.10h. For devices running FastIron release 09.0.10j and later, RUCKUS recommends configuring specific key exchange and host key algorithms on the devices to resolve this issue and enable SSH communication. Perform the following procedure to enable SSH communication with devices running FastIron release 08.0.95 or earlier: device# configure terminal device(config)# ip ssh key-ex key-exchange-method SSH key exchange method device(config)# ip ssh key-exchange-method ASCII string Enter algorithms separated by a space: diffie-hellman-group-exchange-sha256 diffie-hellman-group14-sha256 diffie-hellman-group16-sha512 diffie-hellman-group18-sha512 curve25519-sha256@libssh.org diffie-hellman-group14-sha1 ecdh-sha2-nistp256 ecdh-sha2-nistp384 ecdh-sha2-nistp521 curve25519-sha256 device(config)# ip ssh key-exchange-method diffie-hellman-group14-sha1 device(config)# ip ssh host host-key-method SSH host key method device(config)# ip ssh host-key-method ASCII string Enter algorithms separated by a space: ecdsa-sha2-nistp256 ecdsa-sha2-nistp384 rsa-sha2-512 rsa-sha2-256 ssh-rsa device(config)# ip ssh host-key-method ssh-rsa FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 24 Part Number: 53-1005859-01 New in This Release Important Changes in Release 09.0.10a Important Changes in Release 09.0.10d Per Technical Support Bulletin TSB 2022-005 - Starting with release 8.0.95h/9.0.10d, products running a newer Power Over Ethernet (PoE) chipset do not support older releases, the POE functionality in ICX 7150 and ICX 7450 devices that have the new MCU PD69220 will be turned off when connected in a stack running a pre-09.0.10d software image. If you are installing an ICX 7150 or ICX 7450 device that contains MCU PD69220, you can prevent the POE capabilities of the device from being disabled by upgrading the stack to FastIron 09.0.10d or later firmware prior to installing the ICX 7150 or ICX 7450 device. Refer to the Technical Support Bulletins page for more details. Important Changes in Release 09.0.10a NOTE FastIron releases 09.0.00, 09.0.00a, and 09.0.10 are no longer available for download due to the discovery of a critical defect. Refer to TSB 2022-001 – FastIron 09.0.00 and 09.0.10 - Risk of Filesystem Corruption on the Technical Support Bulletins page for more details. RUCKUS recommends upgrading to FastIron release 09.0.10a or later for all ICX switches currently running any of the afore-mentioned releases. All the software features supported in FastIron release 09.0.00, 09.0.00a, and 09.0.10 remain available and supported in FastIron release 09.0.10a and later releases unless specifically noted. For completeness, the feature descriptions for all changes introduced in the unavailable releases; that is, FastIron 09.0.00, 09.0.00a, and 09.0.10, are included in this section. The following changes were introduced in FastIron Release 09.0.10a:",
      "PTP Support on ICX 7150-48ZP Precision Transparent Timing adds support for the ICX 7150-48ZP model.",
      "connected in a stack running a pre-09.0.10d software image.",
      "NOTE",
      "service password-encryption sha1",
      "TCP keychain A configurable TCP authentication option (AO) keychain is supported. The: settings can be applied to BGP and MSDP sessions.",
      "Release 09.0.10a introduces changes to ICX digital certificate commands and parameters, including the following: – Only TFTP or SCP can be used for importing certificates. – HTTPS is enabled by default and no longer has to be configured for SSL server confguration. – Only RSA keys can be used. – Available maximum key sizes are 4096 (the default) and 2048 bits. – Some SSL certificate",
      "Web Management - VLAN settings Enhancements support the following:",
      "Important Changes in Release 09.0.10j",
      "All access to ICX devices is via username and password only. Login without a username or without a password is no longer suppported.",
      "ICX7650-48ZP devices.",
      "Any user accounts created with the deprecated encryption types: are deleted when the switch is upgraded to FastIron release 09.0.10a or later.",
      "Clone VLAN",
      "Software Features",
      "files.",
      "configure flow control.",
      "configuring TCP keychain options.",
      "New in This Release",
      "Anycast-RP",
      "later releases.: • Release 09.0.10a introduces changes to ICX digital certificate commands and parameters, including the following: – Only TFTP or SCP can be used for importing certificates. – HTTPS is enabled by default and no longer has to be configured for SSL server confguration. – Only RSA keys can be used. – Available maximum key sizes are 4096 (the default) and 2048 bits. – Some SSL certificate",
      "Rendezvous points (RPs) Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. MACsec over VXLAN MACsec over VXLAN is an end-to-end security protocol that provides a secured environment to protect Ethernet frames traveling over IP networks. Although VXLAN provides Layer 2 extension across LAN/WAN, connections between sites are not secured. MACsec over VXLAN addresses this and achieves secured Layer-2 extension across LAN/WAN using cross-connect VNIs. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. TCP keychain A configurable TCP authentication option (AO) keychain is supported. The settings can be applied to BGP and MSDP sessions. Refer to the RUCKUS FastIron Security Configuration Guide for information on configuring TCP keychain options. Refer to RUCKUS FastIron IP Multicast Configuration Guide to configure MSDP to use the keychain settings. Refer to RUCKUS FastIron Layer 3 Routing Configuration Guide to configure BGP to use the keychain settings. New SSH key exchange method The DH Group-14 SHA 256 key exchange method is supported for general use. Previously, this method was supported only in FIPS mode. Refer to the RUCKUS FastIron Security Configuration Guide. Web management - AAA Settings Configures the settings to enable web user authentication. Refer to the RUCKUS FastIron Web Management Interface User Guide. Web authentication redirect page customization Remove or modify UserID or Password labels on the authentication redirect page. Refer to the RUCKUS FastIron Security Configuration Guide. Web authentication honoring the RADIUS-returned VLAN Honor a RADIUS-returned VLAN for Web Authentication clients. Refer to the RUCKUS FastIron Security Configuration Guide. Web Management - VLAN settings Enhancements support the following: Clone VLAN Change Default VLAN Refer to the RUCKUS FastIron Web Management Interface User Guide. Unknown Unicast Flood Block (UUFB) UUFB blocks unknown unicast traffic on ports, including Link Aggregation Group (LAG) ports. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. Packets-per-second log timer for BUM traffic rate limiting Packets-per-second (pps) log timer and port dampening for pps ports are introduced. Refer to the RUCKUS FastIron QoS and Traffic Management Configuration Guide. Disabling Multicast Static Group Forwarding for a VLAN Multicast static group forwarding can be disabled at the VLAN Level. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IGMP Filtering and State Limit An IGMP report filter policy can be configured globally or for an Interface. Additionally, the maximum number of IGMP group addresses for the default VRF, or a non-default VRF instance, can be changed globally or at interface level. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. MLD Filtering and State Limit An MLD report filter policy can be configured globally or for an interface. Additionally, the maximum number of MLD group addresses for the default VRF, or a non-default VRF instance, can be changed globally or at the interface level. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IPv4 PIM Join Message Filter IPv4 PIM devices can be configured to accept or reject Join and Prune messages for all the multicast group addresses and for all source addresses. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005859-01 21 New in This Release Software Features Feature Description IPv4 PIM Register Message Filter Rule The register message filter rule for PIM can be configured so that unauthorized multicast sources or groups are blocked. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IPv4 PIM Register Message Rate Limit The maximum number of register packets sent or received per second by a device can be configured. The rate limit for the number of register messages can be set to a relatively low value to avoid adverse pressure on the CPU when numerous sources start concurrently. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IPv6 PIM Join Message Filter IPv6 PIM devices can be configured to accept or reject Join and Prune messages for all the multicast group addresses and for all source addresses. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IPv6 PIM Register Message Filter Rule The register message filter rule for IPv6 PIM can be configured so that unauthorized multicast sources or groups are blocked. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IPv6 PIM Register Message Rate Limit The maximum number of register packets sent or received per second by a device can be configured. The rate limit for the number of register messages can be set to a relatively low value to avoid adverse pressure on the CPU when numerous sources start concurrently. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IPv4 Option Type Filters Drop rules can be configured so that packets are dropped if certain condtions are not met. Refer to the RUCKUS FastIron Layer 3 Routing Configuration Guide. IPv6 Extension Header Option Type Filters Drop rules can be configured for IPv6 so that packets are dropped if certain condtions are not met. Refer to the RUCKUS FastIron Layer 3 Routing Configuration Guide. Syslog threshold Configure a threshold value to generate a warning message when log entries exceed the specified threshold. Refer to the RUCKUS FastIron Monitoring Configuration Guide. System notification of PKI certificate expiration The system sends notifications as certificates that cannot be renewed automatically are approaching expiration. Refer to the RUCKUS FastIron Security Configuration Guide. Support Save Support Save collects logs and information to help troubleshoot an issue. Refer to the RUCKUS FastIron Monitoring Configuration Guide. Secure Wipe The Secure Wipe feature securely erases the flash contents permanently as per DoD 5220.22-M standards and reinstalls the FastIron device. Refer to the RUCKUS FastIron Management Configuration Guide. Access authority to logging by privilege The username command was modified so that a user privilege of 7 can be applied. A user with this privilege level cannot access the output of the show logging command. Configuration archive auto-revert (commit and rollback) The feature provides the capability to revert or rollback to a previous configuration if the changed running configuration is not saved to the non- volatile memory within a pre-defined time. Logging buffer threshold and syslog alarm The threshold option is added to the logging buffered command. When the threshold percentage is exceeded, the system generates a warning message. WEB management enhancement Added ability to manage and replace the configuration archive and ability to configure flow control. Configuration archive max file capacity The maximum configuration archive size has been expanded from 20 to 100 files. DH Group-14 SHA 256 in non-FIPS mode The DH Group-14 SHA 256 key exchange method is supported for general use. ACLs on CPU Ports Brings in the ability to control traffic destined for CPU. Examples include ICMP packets, DHCP packets etc., User will be able to apply access-lists to allow/drop CPU-bound packets matching the ACL rules FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 22 Part Number: 53-1005859-01 New in This Release Software Features Feature Description Breakout support on the ICX 7550 A 40-Gbps breakout cable can be used on ICX 7550 standalone units to convert some 40-Gbps ports into four 10-Gbps subports. Alternatively, a 100/40 Gbps cable can be used in an ICX 7550 standalone switch to break-out certain 40-Gbps ports into four 10-Gbps subports and 100 Gbps ports into four 25-Gbps subports, respectively. Copy UFI image and manifest from flash to USB ICX switches and routers will have the ability to copy a UFI image and manifest file from flash to USB using the CLI. Configuration Archive and Replace ICX switches and routers have the flexibility to back-up and store multiple configuration files in flash. These backed up files can be copied to running configuration to manage system configuration when needed. DHCPv4 client scale IP DHCP binding scalability has been enhanced to support up to 3000 clients. 100-Gbps stacking support on the ICX 7550 100-Gbps stacking support has been included in ICX 7550 IPv6 Source Guard FI 09.0.0 introduces IPv6 Source Guard support which can be used with IPv6 Neighbor Discovery Inspection (NDI) on untrusted ports. RESTCONF RESTCONF is an IETF standard to configure network devices programmatically. It is a successor to REST API and NETCONF configuration protocols and is primarily driven by YANG models that describe the network configurations and operations. RESTCONF can now be used to programmatically configure ICX devices. Multicast enhancements for Software Defined Video-over-Ethernet (SDVoE) Software Defined Video-over-Ethernet (SDVoE) is a software-based AV-over-IP platform that provides solutions for point-to-point connectivity and Ethernet- based audio visual (AV) distribution. A number of enhancements have been introduced for SDVoE. New web UI FI 09.0.00 introduces a brand-new web user interface with monitoring, configuration, remote CLI, and firmware upgrade capabilities. Web authentication white-lists Users can now allow Web Authentication clients to access more than one website or server during the authentication process. The white-list can be defined using IPv4 addresses or FQDN entries. Energy Efficient Ethernet (EEE) on ICX 7550 Copper Ports EEE regulates and saves power consumed by the active hardware components in the switch and conserves power during idle time. Flexlink Flexlink is a link redundancy feature that provides Layer 2 resilience. It is an alternative solution to Spanning Tree Protocol (STP) as it provides link redundancy at a faster network convergence rate than STP and its variants RSTP/ MSTP. IP Based MLD Snooping IP based MLD snooping is a functional enhancement that ensures multicast forwarding entries use Group Address, Source Address, and VLAN as key from this release onwards. This change can now start supporting source-specific multicast deployment scenarios. VXLAN on the ICX 7550 VXLAN support is extended to the ICX 7550 devices. PTP support on ICX 7550 and ICX 7650 PTP support is extended to ICX7550-24F, ICX7550-48F, ICX7650-48F, and ICX7650-48ZP devices. Deprecated Software Features in 09.0.10a The following software features are deprecated in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description RMON The RMON protocol and commands are deprecated in FastIron release 09.0.10. RMON will be re-introduced in a subsequent patch release. FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005859-01 23 New in This Release Important Changes in Release 09.0.10j Feature Description Password encryption options The following encryption types are deprecated in FastIron release 09.0.10a:",
      "available at www.ruckuswireless.com, for a detailed listing of feature and platform support.",
      "The LACP LAG capacity has been increased from 256 to 300 in this design.",
      "First-hop routing (FHR) and last-hop routing (LHR)",
      "Known Behavior: – enable (via configured password for Super-User level privileges) – TACACS • Release 09.0.10a and later releases support only SHA-512 encryption. The following encyption types are deprecated: – service password-encryption sha1 – service password-encryption sha256",
      "RMON will be re-introduced in a subsequent patch release.",
      "The option followed by an IP address or a list of IP addresses will add the keyword ip and the entries as one or more IP addresses.",
      "use the keychain settings.",
      "Multicast Routing PIM Enhancements over MCT The following are supported on MCT clusters:: • First-hop routing (FHR) and last-hop routing (LHR) • Anycast-RP • Rendezvous points (RPs)",
      "IP Based MLD Snooping IP based MLD snooping is a functional enhancement that ensures multicast: forwarding entries use Group Address, Source Address, and VLAN as key from this release onwards. This change can now start supporting source-specific multicast deployment scenarios.",
      "and Traffic Management Configuration Guide.",
      "Any other value is considered an ASCII string, and the keyword ascii is added to the configuration. One-Gbps Breakout Ports Port density can be increased at the lower speed of 1 Gbps on a breakout port using this feature. You can change the speed of 10-Gps breakout ports to 1-Gbps breakout ports dynamically without performing a reload. Refer to the RUCKUS FastIron Management Configuration Guide. MCT-Stacking ICX 7850 stacks can be configured as cluster peers in a Multi-Chassis Trunking (MCT) configuration. The LACP LAG capacity has been increased from 256 to 300 in this design. NOTE MCT support for ICX 7850 stacks as peers is of Beta quality in release 09.0.10 and is of production quality from the FastIron 09.0.10a patch. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. MCT Hitless Sequential Upgrade MCT protocol version check is introduced to achieve MCT hitless upgrade. The new solution allows two units running 09.0.10 and higher software releases to form MCT peers, as long as their MCT protocol versions match and both peers are from the same model family. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 20 Part Number: 53-1005859-01 New in This Release Software Features Feature Description Multicast Routing PIM Enhancements over MCT The following are supported on MCT clusters:",
      "Guide.",
      "file from flash to USB using the CLI.",
      "A number of changes and enhancements have been introduced for MVR. These: include the following: • MVR is supported for both tagged and untagged receiver ports. • MVR is supported for router images only. • Query messages are supported for MVR. • Multicast data is supported for MVR.",
      "MVR-Tagged VLAN Support Multicast VLAN Registration (MVR) enables more efficient distribution of: multicast streams across Layer 2 networks, and the duplication of multicast streams from the same source is eliminated while maintaining isolation between hosts on different VLANs.",
      "automatically are approaching expiration.",
      "A range of mapped VLANs can be extended over a VXLAN overlay- gateway. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005859-01 17 New in This Release Software Features Feature Description VXLAN Remote Site Monitoring and Redundancy You can configure primary and secondary IP addresses for the remote endpoint of a VXLAN tunnel. In addition, you can configure a keep-alive timer and the number of retries to ensure that the tunnel is always established to an active endpoint. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. Proactive Monitoring of Cable Signal Errors and Logging Proactive Monitoring of Cable Signal Errors and Logging helps to identify deteriorating cables in a network. Cable signal errors are identified proactively and, once errors are identified, a SYSLOG message is logged so that you can check and monitor the link. Refer to the RUCKUS FastIron Monitoring Configuration Guide. New Software Features in 09.0.10c The following software features and enhancements are introduced in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description MACsec data-delay protection The MKA group configuration command macsec delay-protection has been added. RMON Remote Monitoring (RMON) support is restored beginning with this release. New Software Features in 09.0.10b The following software features and enhancements are introduced in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description MACsec Enhancements Configurable MKA keychains applied at the interface level are introduced as an alternative to the individually configured pre-shared key. Refer to \"Media Access Control Security\" and \"Creating and Configuring an MKA Keychain\" in the RUCKUS FastIron Security Configuration Guide. RADIUS Security Enhancements RADIUS server security (RADsec) is supported for Flexible authentication from this release. Previously, RADsec was supported only for Console login. NOTE On ICX 7250 and ICX 7450 series switches, the device trustpoint will not work with RADIUS due to the strict validation of certificates. For TLS with RADIUS on these switches, an external certificate needs to be copied to ICX in order to establish a successful TLS session. Refer to the RUCKUS FastIron Security Configuration Guide. VXLAN Parameter Enhancements Certain statistics pertaining to VXLAN virtual ports and VXLAN Network Identifiers (VNIs) can be collected and controlled. Additionally, you can clear statistics for an entire VXLAN gateway tunnel or for a particular VNI. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. ICX SSH Support for SHA-2 with 384 bits An ICX device can be accessed using an ECDSA algorithm with 384-bit or 256-bit key sizes while connecting through SSH. Refer to the RUCKUS FastIron Security Configuration Guide. SNMP Support for the RUCKUS VXLAN MIB The VXLAN MIB lists the objects that give the management information for configuring the VXLAN feature. VXLAN MIB is a RUCKUS proprietary implementation. Refer to the RUCKUS FastIron MIB Reference, 09.0.10b. FastIron 09.0.10k for RUCKUS ICX Switches Release Notes Version 1 18 Part Number: 53-1005859-01 New in This Release Software Features Feature Description SNMP Support for Fixed Rate-Limiting and Input Rate-Limiting The Common Access Rate (CAR) MIB has been updated. Refer to the RUCKUS FastIron MIB Reference, 09.0.10b. SNMP Support for FlexAuth Web Authentication Configuration New OIDs are introduced to enable uplink ports in webauth configuration. Refer to the RUCKUS FastIron MIB Reference, 09.0.10b. New Software Features in 09.0.10a NOTE FastIron releases 09.0.00, 09.0.00a, and 09.0.10 are no longer available for download due to the discovery of a critical defect. Refer to TSB 2022-001 – FastIron 09.0.00 and 09.0.10 - Risk of Filesystem Corruption on the Technical Support Bulletins page for more details. RUCKUS recommends upgrading to FastIron release 09.0.10a or later for all ICX switches currently running any of the afore-mentioned releases. All the software features supported in FastIron release 09.0.00, 09.0.00a, and 09.0.10 remain available and supported in FastIron release 09.0.10a and later releases unless specifically noted. For completeness, the feature descriptions for all changes introduced in the unavailable releases; that is, FastIron 09.0.00, 09.0.00a, and 09.0.10, are included in this section. The following software features and enhancements are introduced in this release. Refer to the FastIron Features and Standards Support Matrix, available at www.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description Layer 3 Priority Flow Control Priority Flow Control has been extended to ICX 7850 devices at the global level. Refer to \"Flow Control and Buffer Management\" in the RUCKUS FastIron QoS and Traffic Management Configuration Guide. Configurable ICX SSH port for connection with SmartZone The manager ssh-port command has been introduced to allow configuring a custom port for connecting to SmartZone. Refer to \"Configuring a Custom Port Number for Connection to SmartZone\" in the RUCKUS FastIron Management Configuration Guide. MVR-Tagged VLAN Support Multicast VLAN Registration (MVR) enables more efficient distribution of multicast streams across Layer 2 networks, and the duplication of multicast streams from the same source is eliminated while maintaining isolation between hosts on different VLANs. A number of changes and enhancements have been introduced for MVR. These include the following:",
      "Neighbor Discovery Inspection (NDI) on untrusted ports.",
      "RESTCONF RESTCONF is an IETF standard to configure network devices programmatically. It: is a successor to REST API and NETCONF configuration protocols and is primarily driven by YANG models that describe the network configurations and operations. RESTCONF can now be used to programmatically configure ICX devices.",
      "(LAG) ports.",
      "some 40-Gbps ports into four 10-Gbps subports. Alternatively, a 100/40 Gbps: cable can be used in an ICX 7550 standalone switch to break-out certain 40-Gbps ports into four 10-Gbps subports and 100 Gbps ports into four 25-Gbps subports, respectively.",
      "Previously, this method was supported only in FIPS mode.",
      "MSTP.",
      "MCT support for ICX 7850 stacks as peers is of Beta quality in: release 09.0.10 and is of production quality from the FastIron 09.0.10a patch.",
      "DHCPv4 client scale IP DHCP binding scalability has been enhanced to support up to 3000 clients.: 100-Gbps stacking support on the ICX 7550 100-Gbps stacking support has been included in ICX 7550",
      "introduced.",
      "Secure Wipe The Secure Wipe feature securely erases the flash contents permanently as per",
      "the switch and conserves power during idle time.",
      "MVR is supported for both tagged and untagged receiver ports.",
      "Image copy using the system-manifest will accept only \"/\". The system will not accept \"\\\" as it did in 08.0.95 and earlier releases.",
      "applied. A user with this privilege level cannot access the output of the show: logging command.",
      "09.0.10, are included in this section.",
      "using this feature. You can change the speed of 10-Gps breakout ports to 1-Gbps: breakout ports dynamically without performing a reload.",
      "Syslog threshold Configure a threshold value to generate a warning message when log entries: exceed the specified threshold.",
      "Release 09.0.10a and future releases do not support ICX 7750 devices. The ICX 7750 is supported in 08.0.95 and will continue to be supported in 08.0.95 maintenance releases.",
      "ASCII string Enter algorithms separated by a space:: diffie-hellman-group-exchange-sha256 diffie-hellman-group14-sha256 diffie-hellman-group16-sha512 diffie-hellman-group18-sha512 curve25519-sha256@libssh.org diffie-hellman-group14-sha1 ecdh-sha2-nistp256 ecdh-sha2-nistp384 ecdh-sha2-nistp521 curve25519-sha256 device(config)# ip ssh key-exchange-method diffie-hellman-group14-sha1 device(config)# ip ssh host host-key-method SSH host key method device(config)# ip ssh host-key-method",
      "hex and will interpret the following entry as a hex value.: • The option followed by an IP address or a list of IP addresses will add the keyword ip and the entries as one or more IP addresses. • Any other value is considered an ASCII string, and the keyword ascii is added to the configuration.",
      "VXLAN on the ICX 7550 VXLAN support is extended to the ICX 7550 devices."
    ],
    "cli_commands": {
      "new": [],
      "modified": [],
      "deprecated": [],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": []
  },
  {
    "version": "10.0.00a",
    "hardware": [
      "ICX7650-48P",
      "ICX7550-48ZP",
      "ICX7850-48F",
      "ICX8200-48PF",
      "ICX7550-24F",
      "ICX7750",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX7550-48F",
      "ICX7150",
      "ICX7550-24ZP",
      "ICX7650-48F",
      "ICX8200",
      "ICX7250",
      "ICX8200-24P",
      "ICX7450",
      "ICX7850-48C",
      "ICX7850-32Q",
      "ICX7550-24P",
      "ICX8200-48P",
      "ICX7850-48FS",
      "ICX8200S",
      "ICX7550",
      "ICX7650",
      "ICX7550-48P"
    ],
    "software_features": [
      "IGMPv2/MLDv1 Report based *,G group creation",
      "Release 10.0.00 and future releases do not support ICX 7150, ICX 7250, or ICX 7450 devices. FastIron 09.0.10 (including patches) will be the last supported code stream for ICX 7150, ICX 7250, and ICX 7450 devices. Please check the product support page for a specific device for the current code recommendation. FastIron 10.0.00a for RUCKUS ICX Switches Release Notes Version 6 Part Number: 53-1005782-06 13 New in This Release",
      "Beginning with FastIron release 10.0.0, a switch (\"Layer 2\") image will no longer be provided for ICX devices. Only the router (\"Layer 3\") image will be available. On upgrade to FastIron 10.0.00, the configuration of any ICX devices operating with the switch image will automatically be translated to the equivalent router image configuration. The following features are deprecated as a result of this change: – The IP default gateway – The management VLAN – Global configuration of the IP address (Going forward, the IP address must be configured at the interface level for each port.) Refer to the RUCKUS FastIron Software Upgrade Guide for additional details.",
      "IPv6 PIM Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide and the RUCKUS FastIron Layer 3 Routing Configuration Guide. VLAN-Based Mirroring Ehancement For VLAN-based mirroring, the maximum number of monitor-configured VLANs increased from 8 to 256. Refer to the RUCKUS FastIron Monitoring Configuration Guide for more information on VLAN-based mirroring. ACL Scaling on ICX 8200 Switches ACL scaling has been updated. Refer to \"ACLs\" in the RUCKUS FastIron Security Configuration Guide. IPv6 User ACL Fragment Filtering on ICX 8200 Switches ICX 8200 switches include only the first IPv6 packet fragments in access control list (ACL) rule matching. In contrast, other ICX devices include non-first fragments in rule matching. Refer to \"ACLs\" in the RUCKUS FastIron Security Configuration Guide. TCAM Usage Show Command Differences on ICX 8200 Switches ICX 8200 series switches exclusively use the show access-list tcam stage- snapshot unit id command instead of the show access-list tcam slice-snapshot unit id command used on other ICX switches. The show access-list tcam stage- snapshot unit id command is used to review hardware usage, where as the show access-list tcam slice-snapshot unit idcommand is used to view the rules configured in TCAM. Important Changes in Release 10.0.00 The following changes were introduced in FastIron Release 10.0.00:",
      "VRRP-E",
      "IGMPv3/MLDv2 INCLUDE(S) Report based (S,G) group creation This prevents the loss of the initial packets when multicast traffic arrives. Refer to the RUCKUS FastIron IP Multicast Configuration Guide. IPv6 Virtual Router Redundancy Protocol Extended (VRRP-E) Enhancement IPv6 VRRP-E short-path forwarding is introduced. Refer to the RUCKUS FastIron Layer 3 Routing Configuration Guide. Precision Time Protocol-Transparent Clock (PTP-TC) Packet Prioritization PTP-TC is supported on RUCKUS ICX 7550, ICX 7650, and ICX 7850 devices. Refer to the RUCKUS FastIron Management Configuration Guide. Power over Ethernet (PoE) Oversubscription The inline power allocation dynamic command was introduced for dynamic PoE management. Refer to the RUCKUS FastIron Management Configuration Guide and to the command page in the RUCKUS FastIron Command Reference. FastIron 10.0.00a for RUCKUS ICX Switches Release Notes Version 6 12 Part Number: 53-1005782-06 New in This Release Important Changes in Release 10.0.00 Feature Description Spanning Tree Protocol show command updates and new clear commands Topology details at the VLAN and interface level have been added to certain show commands for Spanning Tree protocols (802.1D, 802.1W, MSTP). Related new clear commands for xSTP have also been introduced. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide and to the RUCKUS FastIron Command Reference for specific command pages. IPv6 Multicast NSR Non-stop IPV6 multicast routing is supported during stack switchover or failover by keeping the software state on the active controller and standby controller in sync so that there is no disturbance in the multicast traffic during the transition of standby to active. IPv6 Support on Multi-Chassis Trunking (MCT) IPv6 support on MCT has been added for the following:",
      "Show-path forwarding"
    ],
    "cli_commands": {
      "new": [
        "for RUCKUS ICX Switches Release Notes Version 6",
        "New in This Release",
        "Important Changes in Release 10.0.00",
        "Feature Description",
        "show commands for Spanning Tree protocols (802.1D, 802.1W, MSTP). Related",
        "VRRP-E",
        "Show-path forwarding",
        "IPv6 PIM",
        "list (ACL) rule matching. In contrast, other ICX devices include non-first",
        "snapshot unit id command instead of the show access-list tcam slice-snapshot",
        "unit id command used on other ICX switches. The show access-list tcam stage-",
        "snapshot unit id command is used to review hardware usage, where as the",
        "show access-list tcam slice-snapshot unit idcommand is used to view the rules",
        "Important Changes in Release 10.0.00",
        "The following features are deprecated as a result of this change:",
        "– The IP default gateway",
        "– The management VLAN",
        "New in This Release",
        "CLI Commands",
        "NOTE",
        "Operational Notes",
        "CLI Commands",
        "The following command has been reinstated for this release:",
        "enable strict-password-enforcement"
      ],
      "modified": [
        "clear 802-1w statistics",
        "clear chassis unit-id",
        "clear mstp statistics",
        "New in This Release",
        "CLI Commands",
        "clear span statistics",
        "inline power allocation dynamic",
        "ip icmp burst-max",
        "ip icmp icmp-fragments",
        "ip tcp burst-max",
        "ip tcp fin-urg-psh",
        "ip tcp over-mac-multicast",
        "ip tcp port-zero",
        "ip tcp syn-fin",
        "ip tcp syn-rst",
        "ip tcp tcp-all",
        "ip tcp zero-flags",
        "show ip multicast data-plane",
        "show ipv6 multicast data-plane",
        "show ipv6 pim counter",
        "show statistics dos-attack icmp",
        "show statistics dos-attack icmp fragments",
        "show statistics dos-attack tcp"
      ],
      "deprecated": [
        "clear 802-1w statistics",
        "clear chassis unit-id",
        "clear mstp statistics",
        "New in This Release",
        "CLI Commands",
        "clear span statistics",
        "inline power allocation dynamic",
        "ip icmp burst-max",
        "ip icmp icmp-fragments",
        "ip tcp burst-max",
        "ip tcp fin-urg-psh",
        "ip tcp over-mac-multicast",
        "ip tcp port-zero",
        "ip tcp syn-fin",
        "ip tcp syn-rst",
        "ip tcp tcp-all",
        "ip tcp zero-flags",
        "show ip multicast data-plane",
        "show ipv6 multicast data-plane",
        "show ipv6 pim counter",
        "show statistics dos-attack icmp",
        "show statistics dos-attack icmp fragments",
        "show statistics dos-attack tcp"
      ],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": [
      "RUCKUS",
      "C08PF"
    ]
  },
  {
    "version": "10.0.10g_cd3",
    "hardware": [],
    "software_features": [
      "Do not support RUCKUS One or SmartZone.",
      "A range of mapped VLANs can be extended over a VXLAN overlay- gateway. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. VXLAN - VXLAN Remote Site Monitoring and Redundancy You can configure primary and secondary IP addresses for the remote endpoint of a VXLAN tunnel. In addition, you can configure a keep-alive timer and the number of retries to ensure that the tunnel is always established to an active endpoint. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. ICX-Management in the RUCKUS One via HTTPS This release adds RUCKUS One support on ICX 8200 series switches. Refer to the RUCKUS FastIron Management Configuration Guide. Important Changes RESTCONF Disabled When Connecting to RUCKUS One Beginning with FastIron release 10.0.10f, RESTCONF is disabled when any ICX device is connected to RUCKUS One. RESTCONF cannot be enabled as long as the device is connected to RUCKUS One. Updated Thermal Policy for ICX 8200 Devices The FastIron release 10.0.10d_cd3 has an updated thermal policy for ICX 8200 devices with a fine-tuned fan operation for better temperature stability. FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005862-01 23 New in This Release Important Changes Enabling SSH Communication Between 10.0.10c Devices and 08.0.95 Devices Due to the differences in default key exchange and host key algorithms in different FastIron releases, devices running different releases may experience SSH connection issues. For devices running FastIron release 09.0.10 and later, when trying to establish an SSH connection with a device running FastIron release 08.0.95 or earlier, a mismatch in algorithms prevents the SSH connection from being established. The problem arises during the negotiation phase, where the server offers key exchange and host key algorithms that are not compatible with the default settings of the device running FastIron release 09.0.10 or later. For devices running FastIron release 10.0.10c and later, RUCKUS recommends configuring specific key exchange and host key algorithms on the devices to resolve this issue and enable SSH communication. Perform the following procedure to enable SSH communication with devices running FastIron release 08.0.95 or earlier: device# configure terminal device(config)# ip ssh key-ex key-exchange-method SSH key exchange method device(config)# ip ssh key-exchange-method ASCII string Enter algorithms separated by a space: diffie-hellman-group-exchange-sha256 diffie-hellman-group14-sha256 diffie-hellman-group16-sha512 diffie-hellman-group18-sha512 curve25519-sha256@libssh.org diffie-hellman-group14-sha1 ecdh-sha2-nistp256 ecdh-sha2-nistp384 ecdh-sha2-nistp521 curve25519-sha256 device(config)# ip ssh key-exchange-method diffie-hellman-group14-sha1 device(config)# ip ssh host host-key-method SSH host key method device(config)# ip ssh host-key-method ASCII string Enter algorithms separated by a space: ecdsa-sha2-nistp256 ecdsa-sha2-nistp384 rsa-sha2-512 rsa-sha2-256 ssh-rsa device(config)# ip ssh host-key-method ssh-rsa ICX 8200 Multigigabit Support in FastIron 10.0.10b ICX 8200 switches with multigigabit support that are shipped with FastIron release 10.0.10b can be downgraded, if necessary, to FastIron release 10.0.10a; however, they should not be downgraded to earlier releases due to driver incompatibilities. In the case of an unintentional downgrade, the switch can be recovered by booting with the golden image using the following steps. 1. Make a console connection to the switch. 2. Continuously enter b to stop at the boot prompt. 3. Enter the command boot_golden_primary or boot_golden_secondary. AAA authentication Behavior Changes in FastIron Release 10.0.10a From FastIron release 10.0.10a, there is a behavior change for the AAA authentication method-list TACACS+ option. The aaa authorization exec default tacacs+ command must be configured before the aaa authentication login default tacacs+ command or the aaa authentication enable default tacacs+ command can be configured. If you attempt to configure either of these commands first, the following message is displayed: Warning- Please configure exec authorization using TACACS+ to get user privilege. FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 24 Part Number: 53-1005862-01 New in This Release",
      "Do not support stacking and only operate as standalone devices. The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https://support.ruckuswireless.com/, for a detailed listing of feature and platform support. Feature Description Support for 2.5 Gbps and 5 Gbps multi-gig ports The ICX 7850-48C devices support 2.5 Gbps and 5 Gbps multi-gig ports in addition to the existing support for 1 Gbps and 10 Gbps speeds. 9Support for stacking, RUCKUS One and SmartZone will be added in a future software release. FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005862-01 17 New in This Release Software Features Feature Description Audio Visual (AV) profile support This release adds support for AV profiles that can be configured using RUCKUS Unleashed. These profiles configure optimized settings to forward AV traffic. This feature is supported only on the ICX 8200-48P, ICX 8200-48PF, ICX 8200-48PF2, ICX 8200-24PV, and ICX 8200-C08PFV devices. Refer to the RUCKUS Unleashed 200.16 User Guide for an overview of AV Profiles and instructions for creating an AV Profile for your Unleashed-managed ICX switch.. Refer to the RUCKUS AV Switch Quick Setup Guide. Disabling syslog for MAC address movement Syslog messages for MAC moves can be disabled on a network device to reduce unnecessary log entries and simplify log management. Refer to the RUCKUS FastIron Management Configuration Guide. Automatic fanless mode The ICX 8200-24PV devices have fanless mode enabled by default. RADIUS status-server enhancements10 Provides the ability to disable RADIUS status-server messages. By default, status-server messages are enabled, and server status is continually checked, resulting in a high number of log messages. As an option, you can use the status-server off setting to disable the status-server messages for the configured RADIUS server host. New Software Features in 10.0.10d_cd3 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10d_cd2 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10d_cd1 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. 10This feature was introduced in FastIron Release 10.0.10c_cd4 and 10.0.10e. It is not supported in FastIron 10.0.10d. FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 18 Part Number: 53-1005862-01 New in This Release Software Features NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10d The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https://support.ruckuswireless.com/, for a detailed listing of feature and platform support. Feature Description NTP Server Start Delay The NTP server response from an ICX switch can be delayed until the ICX switch itself has synchronized with an external NTP server. This can be used when an ICX switch is being used as both an NTP server as well as a client. Refer to the RUCKUS FastIron Management Configuration Guide New Software Features in 10.0.10c_cd4 This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. Feature Description RADIUS status-server enhancements10 Provides the ability to disable RADIUS status-server messages. By default, status-server messages are enabled, and server status is continually checked, resulting in a high number of log messages. As an option, you can use the status-server off setting to disable the status-server messages for the configured RADIUS server host. New Software Features in 10.0.10c_cd3 This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. Feature Description DHCP6 Server options 17 and 52 Brings support for enabling DHCP6 server options 17 and 52 to help the clients discover SmartZone via IPv6. Display encrypted password Reintroduces the previous behavior with FI 08.0.95 (or older) releases where the encrypted password is displayed in the running configuration. 10This feature was introduced in FastIron Release 10.0.10c_cd4 and 10.0.10e. It is not supported in FastIron 10.0.10d. FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005862-01 19 New in This Release Software Features New Software Features in 10.0.10c_cd2 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10c_cd1 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10c The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https://support.ruckuswireless.com/, for a detailed listing of feature and platform support. Feature Description VXLAN Enhancement Support added for VTEP configuration on VE interface. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. RADIUS priority You can specify the connection priority when configuring multiple RADIUS servers for 802.1x, Mac authentication, or Web authentication. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Additional SSH encryption methods The ip ssh host-key-method command introduces options for enabling or disabling host key algorithms. The ip ssh key-exchange-method command is updated to include new secure key-exchange methods. The ip ssh encryption command is introduced to allow selection of a range of new encryption algorithms. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Additional SSH security options The ip ssh stricthostkeycheck ask command prompts the user to confirm the authenticity of the remote host if the host key is not recognized. The ip ssh delete-known-host-key command deletes the known host key for a server and prompts the user to accept or reject the new key on the next connection attempt. Refer to the RUCKUS FastIron Security Configuration Guide for more information. BSI C5 Cloud Mode Enhancements have been added in support of the German Federal Office for Information Security (BSI) cloud computing requirements (C5). The new BSI Cloud mode supports onboarding to SmartZone using an ECDSA certificate. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Enhance ICX Client Visibility ICX Client Visibility for RUCKUS One is enhanced to include IP address, MAC address, hostname, OS, vendor class ID, username, and device name of the connected devices. Refer to the RUCKUS FastIron Management Configuration Guide for more information. FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 20 Part Number: 53-1005862-01 New in This Release Software Features Feature Description RESTConf support for Web Authentication The RUCKUS Web authentication method provides an ideal port-based authentication and this can be configured on the device using the RESTConf management protocol. Refer to the RUCKUS FastIron RESTCONF Programmers Guide for more information. RESTConf support for VXLAN and VTEP VXLAN and VTEP can be configured on the device using the RESTConf management protocol. RESTConf for VXLAN is not supported for ICX 8200 devices. Refer to the RUCKUS FastIron RESTCONF Programmers Guide for more information. Support for RADIUS Authentication via RUCKUS One Enables sending RADIUS authentication requests to RUCKUS ONE via the NATS channel. New Software Features in 10.0.10b_cd1 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10b The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https://support.ruckuswireless.com/, for a detailed listing of feature and platform support. Feature Description Disabling web-management when RUCKUS One or SmartZone is connected Software behavior change when an ICX device is managed by RUCKUS One or SmartZone. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Display SmartZone username in syslog When SmartZone is managing an ICX device, the ICX syslogs for events generated by SmartZone include the SmartZone administrator username. Refer to the RUCKUS FastIron Management Configuration Guide for more information on ICX-Management. Login privilege mode You can configure the ICX device to enter privileged EXEC mode after a successful login through Telnet or SSH. Refer to the RUCKUS FastIron Security Configuration Guide for more information. ICX-Management configuration option ICX-Management commands previously configured only in Privileged EXEC mode can also be configured in Global configuration mode. Refer to Modified Commands in Release 10.0.10 on page 30 and to the RUCKUS FastIron Command Reference. New Software Features in 10.0.10a_cd3 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005862-01 21 New in This Release Software Features New Software Features in 10.0.10a_cd2 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10a_cd1 There are no new software features in this release. This is a FastIron Continuous Deployment (CD) release, which addresses a smaller number of issues than a single-letter patch release or a major release. NOTE Not all CD releases go through RUCKUS One (Cloud) qualification. New Software Features in 10.0.10a There are no new software features in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https:// support.ruckuswireless.com/, for a detailed listing of feature and platform support. New Software Features in 10.0.10 NOTE Features introduced in FastIron release 09.0.10d and certain features introduced in FastIron release 09.0.10e are not supported in FastIron release 10.0.00 but are supported in FastIron release 10.0.10.11 The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https://support.ruckuswireless.com/, for a detailed listing of feature and platform support. Feature Description Port Profiles Port profiles can be pre-defined and dynamically applied based on the ICX device type connected to the port. Refer to the RUCKUS FastIron Management Configuration Guide. 11FastIron release 09.0.10d features not supported in FastIron release 10.0.00 but supported in FastIron release 10.0.10: Support for Network Segmentation, Dynamic Bootstrap Protocol (BOOTP) Support, DHCP - IP to Physical Port Mapping, VXLAN with Routing in and out of tunnels (RIOT), VXLAN - VXLAN Network Identifier (VNI) Scale Enhancement, and VXLAN - VXLAN Remote Site Monitoring and Redundancy FastIron release 09.0.10e features not supported in FastIron release 10.0.00 but supported in FastIron release 10.0.10: RUCKUS One (HTTPS-based Ruckus Cloud management, including on ICX 8200 series switches) and new RestCONF modules described in the RUCKUS FastIron RESTCONF Programmers Guide FastIron 10.0.10g_cd3 for RUCKUS ICX Switches Release Notes Version 1 22 Part Number: 53-1005862-01 New in This Release Important Changes Feature Description Support for Network Segmentation This release adds support for network segmentation using SmartZone 6.1.1 or SmartZone 6.1.2. The enhancement includes changes in Web authentication to accept a RADIUS- returned VLAN attribute for a Web authentication client, support for VXLAN remote site redundancy, VXLAN RIOT, and VXLAN scaling enhancements. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide and the RUCKUS FastIron Security Configuration Guide. Fanless mode Fanless mode can be configured on certain ICX 8200 devices. Refer to the RUCKUS FastIron Management Configuration Guide. Domain name resolution You can resolve the domain name for an IP address by querying the DNS server using the nslookup command. Refer to the RUCKUS FastIron Command Reference. Dynamic Bootstrap Protocol (BOOTP) Support BOOTP allows the DHCP server to assign an IP address or range of addresses to the BOOTP clients within its address pool. Refer to the RUCKUS FastIron DHCP Configuration Guide. DHCP - IP to Physical Port Mapping IP addresses can be reserved within a DHCP address pool against selected Ethernet ports. This allows any device connecting to the selected port on the switch to obtain the same IP address irrespective of the client identifier sent by the device. Newly connected devices on a port are prevented from obtaining a new IP address. Refer to the RUCKUS FastIron DHCP Configuration Guide. VXLAN with Routing in and out of tunnels (RIOT) VXLAN with RIOT allows traffic to be routed into and out of Layer 2 VXLAN tunnels. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide. VXLAN - VXLAN Scale Enhancements VXLAN Scale Enhancements support the following:",
      "A range of VLANs can be mapped to a VXLAN Network Identifier (VNI) for a VXLAN overlay-gateway."
    ],
    "cli_commands": {
      "new": [],
      "modified": [],
      "deprecated": [],
      "reintroduced": [
        "The following commands have been added (new in this release):",
        "bsicloud enable",
        "ip dhcp-client information enable",
        "ip ssh delete-known-host-key",
        "ip ssh encryption",
        "ip ssh host-key-method",
        "New in This Release",
        "CLI Commands",
        "ip ssh stricthostkeycheck ask",
        "show ip dhcp-client information",
        "crypto key generate",
        "ip ssh key-exchange-method",
        "radius-server host",
        "ip ssh encryption aes-only",
        "aaa authentication login privilege-mode"
      ]
    },
    "rfcs": [],
    "mibs": [
      "C08PF-X"
    ]
  },
  {
    "version": "10.0.20b_cd3",
    "hardware": [
      "ICX7650-48P",
      "ICX8100-48P",
      "ICX8100-24P",
      "ICX7550-48ZP",
      "ICX7850-48F",
      "ICX8200-24ZP",
      "ICX8200-48PF",
      "ICX7550-24F",
      "ICX7650-48ZP",
      "ICX7850",
      "ICX8200-24FX",
      "ICX8200-24PV",
      "ICX7550-48F",
      "ICX7550-24XZP",
      "ICX7550-24ZP",
      "ICX7650-48F",
      "ICX8200",
      "ICX8200-48F",
      "ICX8200-24P",
      "ICX7850-48C",
      "ICX7850-32Q",
      "ICX7550-24P",
      "ICX8200-48P",
      "ICX8200-24F",
      "ICX7850-48FS",
      "ICX7550",
      "ICX8100",
      "ICX7650",
      "ICX8200-48ZP",
      "ICX7550-48P"
    ],
    "software_features": [
      "ICX Dynamic Breakout support and Breakout Support on Stacking",
      "Port MAC Security",
      "DHCPv4 and DHCPv6 Snooping",
      "QoS for Self-Generated Traffic Refer to the RUCKUS FastIron Management Configuration Guide for more information. New Software Features in 10.0.20b_cd1 This release includes fixes for CVE-2024-50607 (ICX Directory Traversal) and CVE-2024-50604 (Image Integrity Check) originally found in FastIron release 08.0.95. For more details see the security bulletin: https://support.ruckuswireless.com/security_bulletins/332. The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at support.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description Support for RUCKUS ICX 8100 devices FastIron release 10.0.20b_cd1 introduces support for the RUCKUS ICX 8100 Series switches. Refer to the RUCKUS FastIron Features and Standards Support Matrix for details and exceptions. Audio Visual (AV) profile support This release adds support for AV profiles that can be configured using RUCKUS Unleashed. These profiles configure optimized settings to forward AV traffic. This feature is supported for ICX 8200-48P, ICX 8200-48PF, ICX 8200-48PF2, ICX 8200-24PV, and ICX 8200-C08PFV devices only. Refer to the RUCKUS Unleashed 200.16 User Guide for an overview of AV Profiles and instructions for creating an AV Profile for your Unleashed-managed ICX switch.. Refer to the RUCKUS AV Switch Quick Setup Guide. Automatic fanless mode The ICX 8200-24PV devices have fanless mode enabled by default. Disabling syslog for MAC address movement Syslog messages for MAC moves can be disabled on a network device to reduce unnecessary log entries and simplify log management. Refer to the RUCKUS FastIron Management Configuration Guide for more information. FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 12 Part Number: 53-1005861-02 New in This Release Software Features Feature Description DHCPv6 Client An ICX Layer 3 device can be set up as a DHCPv6 client to automatically receive essential network configuration details such as an IPv6 address, domain name server (DNS) and domain search list, from a DHCPv6 server. Refer to the RUCKUS FastIron DHCP Configuration Guide for more information. DHCP Static Port Mapping Static port to IP mapping is supported for Virtual Ethernet (VE) interfaces. Refer to the RUCKUS FastIron DHCP Configuration Guide for more information. Dynamic Breakout with stacking This release introduces support for dynamic breakout allowing users to enable breakout without reloading the switch. In addition, dynamic breakout can now be used in conjunction with stacking allowing users to define breakout ports on stack member switches. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Encapsulated Remote Switched Port Analyzer (ERSPAN) Support for ICX 8200 ERSPAN is supported for ICX 8200 devices. Refer to the RUCKUS FastIron Devices. Monitoring Configuration Guide for more information. ICX-Management in the RUCKUS Cloud This release adds RUCKUS One support on ICX 8200-24PV and ICX 8200-C08PFV AV switches. Refer to the RUCKUS FastIron Management Configuration Guidefor more information. ICX-Management in SmartZone This release adds SmartZone support on ICX 8200-24PV and ICX 8200-C08PFV AV switches. SmartZone does not support ICX 7550-24XZP devices. Refer to the RUCKUS FastIron Management Configuration Guidefor more information. Managing ICX Switches from Unleashed Adds support for ICX management in the Unleashed for RUCKUS ICX 8200-24PV, ICX 8200-48P, ICX 8200-48PF, ICX 8200-48PF2, and ICX 8200-C08PFV devices. Refer to the RUCKUS FastIron Management Configuration Guidefor more information. Precision Time Protocol The two-step PTP compliant devices include ICX 7550, ICX 7650, and ICX 7850. Refer to the RUCKUS FastIron Management Configuration Guidefor more information. Radius Authentication Key Length The key-string in the radius-server key command can be from 1 through 128 characters in length. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Rate limit behavior change For ICX 8100 and ICX 8200 devices, updated ACL rate-limiting behavior to apply rate-limits on a per-rule basis instead of the 'cumulative application across all the matching rules in prior releases. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Support for 2.5 Gbps and 5 Gbps multi-gig ports The ICX 7850-48C devices support 2.5 Gbps and 5 Gbps multi-gig ports in addition to the existing support for 1 Gbps and 10 Gbps speeds Traffic policy support with SGACL (IPv4 and IPv6) DSCP matching/marking along with Internal priority marking and Traffic policy support for SGACL. Refer to the RUCKUS FastIron DHCP Configuration Guide for more information. Updates to DHCPv6 Snooping and prefix delegation DHCPv6 snooping is supported at the Ethernet level and supports one prefix delegation option. Refer to the RUCKUS FastIron DHCP Configuration Guide for more information. Updates to wired client The new wired direct-clients enable command causes only the MAC addresses that are directly attached to the switch to be displayed as wired clients. It ignores all the MAC addresses learned from neighboring switches through LLDP. VXLAN support for ICX 8200 devices VXLAN support for ICX 8200 devices is introduced. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. New Software Features in 10.0.20a The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at support.ruckuswireless.com, for a detailed listing of feature and platform support. FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005861-02 13 New in This Release Software Features Feature Description BGP EVPN Multihoming1 For BGP-EVPN Multihoming (MH), a customer device or network (CE) can connect simultaneously to multiple edge nodes. This multi-attachment capability offers redundant, all-active connectivity to the EVPN core network and extends this redundancy across the entire network connected to the core. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. Anycast Gateway with VXLAN Anycast gateway with Virtual Extensible Local Area Network (VXLAN) allows the same gateway IP addresses to be used across all Virtual Tunnel End Points (VTEPs) in a VXLAN network. This ensures that every VTEP can act as the default gateway for the devices connected to it. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. BGP support for RUCKUS ICX 8200 devices Support for BGP4 and BGP4+ on RUCKUS ICX 8200 devices is introduced. Refer to the RUCKUS FastIron Layer 3 Routing Configuration Guide for more information. Distributed Denial-of-Service (DDoS) – GARP Prevention of DDoS attack using Gratuitous ARP packets is introduced for ICX 8200. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Keepalive for MAC Authentication Clients This feature allows the switch to check if the MACauth client is still active or not by spending keep alive messages, which prevents the authentication session from timing out. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Dynamic ACL with Traffic Policy Beginning with FastIron 10.0.20a, rate limiting is supported for IPv4 and IPv6 ingress ACL-based traffic policies on IEEE 802.1X and MAC authentication enabled ports. Refer to the RUCKUS FastIron Security Configuration Guide for more information. RADIUS status-server enhancements Provides the ability to disable RADIUS status-server messages. By default, status-server messages are enabled, and server status is continually checked, resulting in a high number of log messages. As an option, you can use the status-server off setting to disable the status-server messages for the configured RADIUS server host. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Static Routes with IPPM Static Routes with IP Performance Metrics (IPPM) enables the tracking of selected static routes against a watcher profile. If the IPPM profile linked to the watcher profile fails due to reachability issues, an alternative route is selected. Refer to the RUCKUS FastIron Monitoring Configuration Guide for more information. Supportsave The supportsave command supports Management VRF. Refer to the RUCKUS FastIron Monitoring Configuration Guide for more information. 1 A maximum of two Virtual Tunnel End Points (VTEPs) are supported to participate in multihoming (Dualhoming). FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 14 Part Number: 53-1005861-02 New in This Release Software Features Feature Description Port Profile Enhancement New options have been added to the lldp-device command to enhance filtering capabilities for system names and descriptions. The protected-port command has been integrated into the port-profile configuration. The show port-profile-config command has been introduced to view the configuration pushed by the port-profile. Support for breakout has been added in port-profile feature. SNMP support has been introduced to the port-profile feature. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Geo Redundancy Active-Active Mode Support for SmartZone Geo redundancy Active-Active mode is introduced. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Time Profile Time Profile is a configuration tool designed to automate the execution of CLI commands on an ICX device based on predefined schedules. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Rapid Spanning Tree Protocol (2004 standard) IEEE 802.1w Support for RSTP (IEEE 802.1D 2004 standard) introduced. ICX switches supported the 2001 standard previously. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. Limit MSDP Source-Active Messages The MSDP router can be configured to limit the number of source-active messages accepted from each peer. Refer to the RUCKUS FastIron IP Multicast Configuration Guide for more information. Stacking support for MCT on ICX 7550 Support for MCT on ICX 7550 switches including stacking is introduced Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. Local Packet Capture Support to capture mirrored traffic locally on the device as a PCAP file is introduced. DDoS UDP rate limit support on ICX 8200 DDoS UDP rate limit support on ICX 8200 devices is introduced. Traffic policy support for dscp matching in conjunction with dscp remarking, This feature introduces support for traffic policy support for dscp matching in 802.1p-priority-marking and internal-priority-marking or 802.1p-and-internal- conjunction with DSCP remarking, IEEE 802.1p priority marking and internal- marking priority-marking or 802.1p-and-intermal-marking which was a limitation in the prior releases. Options to configure DSCP and CoS values for self generated packets Adds ability to define QoS values (DSCP and IEEE 802.1p) for self generated traffic (management related packets sent by the switch like SSL, SSH, SNMP etc. Refer to the RUCKUS FastIron QoS and Traffic Management Configuration Guide for more information. New Port-mac-security CLI for simplified configuration Improved CLI command to enable port MAC security by allowing options to be provided in one go. DHCP support added at the Ethernet level. Dynamic ARP Inspection (DAI) is supported on Ethernet ports. On ICX 8200 devices, DHCP snooping and DHCPv6 snooping are support at the Ethernet port level. It can be enabled either at the VLAN level or at the Ethernet port level at a time. Refer to the RUCKUS FastIron DHCP Configuration Guide for more information. Dhcpv6 option 37 relay information DHcpv6 option 37 relay information support is added for dhcpv6 snooping feature on ethernet port. FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005861-02 15 New in This Release Software Features New Software Features in 10.0.20 The following software features and enhancements are introduced in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at support.ruckuswireless.com, for a detailed listing of feature and platform support. Feature Description BGP EVPN VXLAN Border Gateway Protocol (BGP) Ethernet Virtual Private Network (EVPN) provides an efficient control plane protocol for a VXLAN. When BGP EVPN is configured for a VXLAN, remote Virtual Tunnel End Points (VTEPs) and Virtual Network Identifiers (VNIs) do not need to be manually configured, and remote MAC addresses can be learned via the control plane. VTEPs in a VXLAN can use BGP EVPN to exchange locally learned Layer 2 and Layer 3 destinations with remote VTEPs. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. Apply an ACL to Multiple Interfaces Simultaneously You can apply an existing ACL to a range of interfaces simultaneously. Refer to the RUCKUS FastIron Security Configuration Guide for more information. RADIUS Location Attribute A vendor-specific attribute (VSA) for a RUCKUS location can be configured for RADIUS authentication requests. The RUCKUS location is configured with the new host-location command. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Flexible Authentication Accepts a VLAN Group Attribute If you configure a VLAN group with the vlan-group command, it is included in RUCKUS VSA options in RADIUS request messages. The VLAN group is supported by the Tunnel-Private-Group-ID (TPGID) attribute. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Allow an 'auth-fail' Client to Remain in the Auth-Default VLAN (Flexible In Flexible authentication, the action in response to a failed authentication can Authentication) be configured as \"permit\" to place the client in the authentication default VLAN. The failure is logged, but the client is not blocked. The \"permit\" option can be configured globally or at the interface level. Refer to the RUCKUS FastIron Security Configuration Guide for more information. Enhancements to DHCP Option 82 and DHCP Option 37 Relay Agent Information Additional security allows a switch to act as the DHCP relay agent to present requests from non-trusted sources. Refer to the RUCKUS FastIron DHCP Configuration Guide for more information. Layer 2 Trace Route Utility This feature traces the traffic path through a specified device in a VLAN. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. IPoE S-tag and C-Tag VLANs When configuring selective Q-in-Q tunneling, customer VLANs (CVLANs) can be added or replaced, enhancing traffic management capabilities in environments where complex VLAN handling is required. When Internet Protocol over Ethernet (IPoE) service-tagged (S-tag) and customer-tagged (C-tag) VLANs are enabled, traffic from different clients or tenants can be segregated, ensuring the efficient use of available VLAN IDs and simplifying the network configuration. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. Assigning Different VLAN IDs to Reserved VLANs The reserved-vlan-map command now allows VLAN 4090 to be reassigned in addition to VLANs 4091 and 4092. Refer to the RUCKUS FastIron Layer 2 Switching Configuration Guide for more information. Image Consistent Check Before Stack Reload This feature prevents the stack from reloading if the user triggers a reload, and an appropriate error message notifies the user of the image version mismatch. Refer to the RUCKUS FastIron Software Upgrade Guide and the RUCKUS FastIron Stacking Configuration Guide for more information. FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 16 Part Number: 53-1005861-02 New in This Release Software Features Feature Description Point-to-Point Protocol over Ethernet Intermediate Agent (PPPoE IA) Point-to-Point Protocol over Ethernet Intermediate Agent (PPPoE IA) acts as another level of security between the host and the broadband remote access server by intercepting all PPPoE Active Discovery (PAD) messages on a per-port basis. Refer to the RUCKUS FastIron Management Configuration Guide for more information. NTP Server Start Delay The NTP server response from an ICX switch can be delayed until the ICX switch itself has synchronized with an external NTP server. This can be used when an ICX switch is being used as both an NTP server as well as a client. Refer to the RUCKUS FastIron Management Configuration Guide for more information. CLI Banner Support for Unicode Characters The banner now can include French Unicode characters. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Time Zone Enhancement Once the start and end day of the month are configured, the recurring summer- time settings are automatically applied each year. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Precision Time Protocol Support on ICX 8200 Devices Precision Time Protocol (PTP-TC) feature support has been added for ICX 8200 devices. Refer to the RUCKUS FastIron Management Configuration Guide for more information. 1-Gbps Support on 10-Gbps Copper GBIC '1000-full' support is added on 10-Gbps Copper gigabit interface converter (GBIC) optics. Refer to the RUCKUS FastIron Management Configuration Guide for more information. 4 x 10-Gbps Breakout Support 4x10G breakout support is added on RUCKUS ICX 7550 24ZP and ICX 7550 24F devices. Refer to the RUCKUS FastIron Management Configuration Guide for more information. IP Performance Metrics (IPPM) IP Performance Metrics (IPPM) supports the monitoring of metrics related to IPv4 and IPv6 data. IPPM generates traffic and reports the statistics to the administrator through syslog messages. IPPM is configured through profiles and can monitor statistics such as jitter, round-trip time (RTT), time to live (TTL), and response time. Refer to the RUCKUS FastIron Monitoring Configuration Guide for more information. RFC 5424 Syslog Enhancements When RFC5424 is enabled, the syslog format includes additional information such as detailed time, structured data, hostname, domain name, and the syslog sequence ID. Refer to the RUCKUS FastIron Monitoring Configuration Guide for more information. Syslog Output Enhancements Information is added to the output of Telnet and SSH messages, including the address of the specified port, the specified destination IP address, and the destination port. Refer to the RUCKUS FastIron Monitoring Configuration Guide for more information. Supportsave Support over IPV6 Protocol IPv6 supports the supportsave command. Refer to the RUCKUS FastIron Monitoring Configuration Guide for more information. OpenFlow Support on ICX 7550 Devices Software-defined networking (OpenFlow) is supported on ICX 7550 devices beginning with this release. Refer to the RUCKUS FastIron SDN Configuration Guide for more information. FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005861-02 17 New in This Release Important Changes Feature Description RESTCONF support for IPPM RESTCONF support is added for the IPPM profile configurations. Refer to the RUCKUS FastIron RESTCONF Programmers Guide for more information. RESTCONF support for Watcher Profile Name RESTCONF support is added for the watcher profile name. Refer to the RUCKUS FastIron RESTCONF Programmers Guide for more information. RESTCONF support for Slot Profile RESTCONF support is added to configure the slot 2 module ports to uplink 40- Gbps and 100-Gbps ports on RUCKUS ICX 7550-24ZP and ICX 7550-24F devices. Refer to the RUCKUS FastIron RESTCONF Programmers Guide for more information. RESTCONF support for Breakout Port RESTCONF support is added for the breakout settings. Refer to the RUCKUS FastIron RESTCONF Programmers Guide for more information. Important Changes NOTE Refer to Software Features on page 11 for a list of new features in this release. Refer to the RUCKUS FastIron Features and Standards Support Matrix, available at https://support.ruckuswireless.com/, for a detailed listing of feature and platform support. 1G Optics and Auto-negotiation When 25G ports on the ICX 7850-48F or 7550-4x25GF module are used with 1G optics, the remote device must have auto-negotiation disabled. This can be accomplished using the gig-default neg-off command on the remote ICX switch. Refer to the RUCKUS FastIron Management Configuration Guide for more information. Switch Priority Changes for Upgrading to FastIron Release 10.0.20a If a switch is to become a root bridge, before upgrading to FastIron release 10.0.20a, the switch priority must be configured to be less than 4096 and the priority of the other switches must be configured to be greater than 4096. If the priority of a switch is less than 4096, the priority will be updated to 0 after the upgrade to FastIron release 10.0.20a. If the switch priority is greater than 4096 and not a multiple of 4096, the priority will be updated to the lower multiple of 4096 after upgrade to FastIron release 10.0.20a. Enabling SSH Communication Between 10.0.10c Devices and 08.0.95 Devices Due to the differences in default key exchange and host key algorithms in different FastIron releases, devices running different releases may experience SSH connection issues. For devices running FastIron release 09.0.10 and later, when trying to establish an SSH connection with a device running FastIron release 08.0.95 or earlier, a mismatch in algorithms prevents the SSH connection from being established. The problem arises during the negotiation phase, where the server offers key exchange and host key algorithms that are not compatible with the default settings of the device running FastIron release 09.0.10 or later. FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 18 Part Number: 53-1005861-02 New in This Release Important Changes For devices running FastIron release 10.0.10c and later, RUCKUS recommends configuring specific key exchange and host key algorithms on the devices to resolve this issue and enable SSH communication. Perform the following procedure to enable SSH communication with devices running FastIron release 08.0.95 or earlier: device# configure terminal device(config)# ip ssh key-ex key-exchange-method SSH key exchange method device(config)# ip ssh key-exchange-method ASCII string Enter algorithms separated by a space: diffie-hellman-group-exchange-sha256 diffie-hellman-group14-sha256 diffie-hellman-group16-sha512 diffie-hellman-group18-sha512 curve25519-sha256@libssh.org diffie-hellman-group14-sha1 ecdh-sha2-nistp256 ecdh-sha2-nistp384 ecdh-sha2-nistp521 curve25519-sha256 device(config)# ip ssh key-exchange-method diffie-hellman-group14-sha1 device(config)# ip ssh host host-key-method SSH host key method device(config)# ip ssh host-key-method ASCII string Enter algorithms separated by a space: ecdsa-sha2-nistp256 ecdsa-sha2-nistp384 rsa-sha2-512 rsa-sha2-256 ssh-rsa device(config)# ip ssh host-key-method ssh-rsa ICX 8200 Multigigabit Support in FastIron 10.0.10b ICX 8200 switches with multigigabit support that are shipped with FastIron release 10.0.10b can be downgraded, if necessary, to FastIron release 10.0.10a; however, they should not be downgraded to earlier releases due to driver incompatibilities. In the case of an unintentional downgrade, the switch can be recovered by booting with the golden image using the following steps. 1. Make a console connection to the switch. 2. Continuously enter b to stop at the boot prompt. 3. Enter the command boot_golden_primary or boot_golden_secondary. AAA authentication Behavior Changes in FastIron Release 10.0.10a From FastIron release 10.0.10a, there is a behavior change for the AAA authentication method-list TACACS+ option. The aaa authorization exec default tacacs+ command must be configured before the aaa authentication login default tacacs+ command or the aaa authentication enable default tacacs+ command can be configured. If you attempt to configure either of these commands first, the following message is displayed: Warning- Please configure exec authorization using TACACS+ to get user privilege. From FastIron release 10.0.10a, there is also a behavior change for the AAA authentication method-list RADIUS option. The aaa authorization exec default radius command must be configured before the aaa authentication login default radius command or the aaa authentication enable default radius command can be configured. If you attempt to configure either of these commands first, the following message is displayed: Warning- Please configure exec authorization using RADIUS to get user privilege. FastIron 10.0.20b_cd3 for RUCKUS ICX Switches Release Notes Version 1 Part Number: 53-1005861-02 19 New in This Release Known Behavior Strict Password Enforcement Available in FastIron Release 10.0.10 Strict password enforcement, reintroduced in FastIron release 10.0.00a, is also available from FastIron release 10.0.10. When strict password enforcement is enabled, new passwords must be a minimum of 15 characters and must meet other requirements. Refer to the RUCKUS FastIron Security Configuration Guide for configuration details. Known Behavior This section describes known behaviors for certain RUCKUS ICX devices and recommended workarounds where they exist. In-Service Software Upgrade (ISSU) to FastIron 10.0.20a is Not Supported In-Service Software Upgrade (ISSU) from prior 10.0.20 FastIron releases to FastIron release 10.0.20a is not supported. Users must reboot the entire stack for the upgrade process to complete. ISSU from FastIron Release 10.0.20a to later releases in the same release stream is supported. ICX 7550 Port LED in PoE Mode When a RUCKUS ICX7550-24ZP or a RUCKUS ICX 7550-48ZP device is operating in PoE mode and the user connects a PD to a 10-Gbps port, the port LED comes up green but immediately goes to amber, although the expected LED color is green. When the PD is connected while the ICX device is not in PoE mode and is then placed in PoE mode, the port LED remains green as expected. Workaround: If you encounter the issue, change the device to any other mode, or rotate to the PoE mode again. The LED will then work as expected.",
      "PPPoE Intermediate Agent",
      "ICX Selective Q-in-Q",
      "Port DSCP Trust Option"
    ],
    "cli_commands": {
      "new": [],
      "modified": [],
      "deprecated": [],
      "reintroduced": []
    },
    "rfcs": [],
    "mibs": [
      "C08PF",
      "C08PFV"
    ]
  }
]